# EAN13编码表 左奇，左偶，右偶
ENCODE_MAP = {
    "0": ["0001101", "0100111", "1110010"],
    "1": ["0011001", "0110011", "1100110"],
    "2": ["0010011", "0011011", "1101100"],
    "3": ["0111101", "0100001", "1000010"],
    "4": ["0100011", "0011101", "1011100"],
    "5": ["0110001", "0111001", "1001110"],
    "6": ["0101111", "0000101", "1010000"],
    "7": ["0111011", "0010001", "1000100"],
    "8": ["0110111", "0001001", "1001000"],
    "9": ["0001011", "0010111", "1110100"],
}

# 第一位数字表，根据前6位的奇偶性确定
FIRST_DIGIT_MAP = {
    "OOOOOO": 0,
    "OOEOEE": 1,
    "OOEEOE": 2,
    "OOEEEO": 3,
    "OEOOEE": 4,
    "OEEOOE": 5,
    "OEEEOO": 6,
    "OEOEOE": 7,
    "OEOEEO": 8,
    "OEEOEO": 9,
}


def get_key_by_value(value: int, dictionary: dict):
    for key, val in dictionary.items():
        if val == value:
            return key
    return None
